<?php
echo "ЗАДАНИЕ 1 </br></br>";

$a = 0;

while ($a <= 100) {
    if ($a % 3 == 0) echo "$a ";
    $a++;
}

echo "</br>";
echo "<hr>";
echo "</br>";
echo "ЗАДАНИЕ 2 </br></br>";

$b = 0;
do {
    if ($b % 2 == 0) {
        if ($b == 0) {
            echo "$b - ноль </br>";
        } else {
            echo "$b - чётное число </br>";
        }
    } else {
        echo "$b - нечётное число </br>";
    };
    $b++;
} while ($b <= 10);

echo "</br>";
echo "<hr>";
echo "</br>";
echo "ЗАДАНИЕ 3 </br></br>";

$russia = [
    "Вологодская область" => ["Череповец", "Вологда", "Шексна", "Кадуй"], 
    "Ленинградская область" => ["Санкт-Петербург", "Петергоф", "Тихвин", "Подпорожье", "Кронштадт"], 
    "Рязанская область" => ["Рязань", "Касимов", "Ряжск", "Скопин", "Рыбное"], 
    "Республика Карелия" => ["Петрозаводск", "Олонец", "Суоярви", "Сортавала", "Беломорск", "Кемь", "Питкяранта"]
];
    foreach ($russia as $regions => $city){
        echo ("<br /> $regions: <br />");        
        foreach ($city as $russia) {
            echo ("$russia, ");
        }
    };

echo "</br>";
echo "<hr>";
echo "</br>";
echo "ЗАДАНИЕ 4 </br></br>";

function transLit($text){
    $abc = ['а'=>'a', 'б'=>'b', 'в'=>'v', 'г'=>'g', 'д'=>'d', 'е'=>'ye', 'ё'=>'yo', 'ж'=>'zh', 'з'=>'z', 'и'=>'i', 'к'=>'k', 'л'=>'l','м'=>'m', 'н'=>'n','о'=>'o', 'п'=>'p','р'=>'r', 'с'=>'s', 'т'=>'t', 'у'=>'u','ф'=>'f','х'=>'kh', 'ц'=>'ts', 'ч'=>'ch', 'ш'=>'sh','щ'=>'tch', 'ъ'=>'"', 'ы'=>'y', 'ь'=>'`', 'э'=>'eh', 'ю'=>'yu', 'я'=>'ya'];
    return strtr(mb_strtolower($text), $abc);
    }

echo transLit("Привет мир! Как дела?");


echo "</br>";
echo "<hr>";
echo "</br>";
echo "ЗАДАНИЕ 5 </br></br>";

function spaseTo($text) {
    return str_replace(" ", "_", $text);
}

echo spaseTo("Привет мир! Как дела?")


?>